STMicroelectronics/STM32CubeF2/Projects/STM322xG_EVAL/Examples/ADC/ADC_TripleModeInterleaved/Inc/main.h
/**
  ******************************************************************************
  * @file    ADC/ADC_TripleModeInterleaved/Inc/main.h 
  * @author  MCD Application Team
  * @brief   Header for main.c module
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f2xx_hal.h"
#include "stm322xg_eval.h"

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* User can use this section to tailor ADCx instance used and associated 
   resources */
/* Definition for ADCx clock resources */
#define ADCx_INSTANCE                       ADC1
#define ADCx_CLOCK_ENABLE()                 __HAL_RCC_ADC1_CLK_ENABLE()

/* Definition for ADCy clock resources */
#define ADCy_INSTANCE                       ADC2
#define ADCy_CLOCK_ENABLE()                 __HAL_RCC_ADC2_CLK_ENABLE();
     
/* Definition for ADCz clock resources */
#define ADCz_INSTANCE                       ADC3
#define ADCz_CLOCK_ENABLE()                 __HAL_RCC_ADC3_CLK_ENABLE();

#define DMAxyz_CLOCK_ENABLE()               __HAL_RCC_DMA2_CLK_ENABLE()     
#define ADCxyz_CHANNEL_GPIO_CLOCK_ENABLE()  __HAL_RCC_GPIOC_CLK_ENABLE()
     
#define ADCxyz_FORCE_RESET()                __HAL_RCC_ADC_FORCE_RESET()
#define ADCxyz_RELEASE_RESET()              __HAL_RCC_ADC_RELEASE_RESET()

/* Definition for ADCx Channel Pin */
#define ADCxyz_CHANNEL_PIN                  GPIO_PIN_2
#define ADCxyz_CHANNEL_GPIO_PORT            GPIOC 

/* Definition for ADCx's Channel */
#define ADCxyz_CHANNEL                      ADC_CHANNEL_12

/* Definition for ADCx's DMA */
#define ADCxyz_DMA_CHANNEL                  DMA_CHANNEL_0
#define ADCxyz_DMA_STREAM                   DMA2_Stream0         

/* Definition for ADCx's NVIC */
#define ADCxyz_DMA_IRQn                     DMA2_Stream0_IRQn
#define ADCxyz_DMA_IRQHandler               DMA2_Stream0_IRQHandler


/* Exported macro ------------------------------------------------------------*/


/* Exported functions ------------------------------------------------------- */


#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
